# ####################################################################

#  Created by RTL Compiler (RC) 05.20-p002 on Wed Feb 22 10:43:54 AM CST 2006

# ####################################################################

set sdc_version 1.4


# Set the current design
current_design dtmf_recvr_core

set_case_analysis 0 [get_ports scan_en]
set_case_analysis 0 [get_ports test_mode]

create_clock -name "refclk" -add -period 8.0 -waveform {0.0 4.0} [get_ports refclk]
set_clock_transition 0.0 [get_clocks refclk]
create_clock -name "m_clk" -add -period 8.0 -waveform {0.0 4.0} [get_pins TEST_CONTROL_INST/m_clk]
set_clock_transition 0.0 [get_clocks m_clk]
create_clock -name "m_rcc_clk" -add -period 16.0 -waveform {0.0 8.0} [get_pins TEST_CONTROL_INST/m_rcc_clk]
set_clock_transition 0.0 [get_clocks m_rcc_clk]
create_clock -name "m_spi_clk" -add -period 16.0 -waveform {0.0 8.0} [get_pins TEST_CONTROL_INST/m_spi_clk]
set_clock_transition 0.0 [get_clocks m_spi_clk]
create_clock -name "m_dsram_clk" -add -period 16.0 -waveform {0.0 8.0} [get_pins TEST_CONTROL_INST/m_dsram_clk]
set_clock_transition 0.0 [get_clocks m_dsram_clk]
create_clock -name "m_ram_clk" -add -period 16.0 -waveform {0.0 8.0} [get_pins TEST_CONTROL_INST/m_ram_clk]
set_clock_transition 0.0 [get_clocks m_ram_clk]
create_clock -name "m_digit_clk" -add -period 16.0 -waveform {0.0 8.0} [get_pins TEST_CONTROL_INST/m_digit_clk]
set_clock_transition 0.0 [get_clocks m_digit_clk]

set_false_path -from [get_ports reset]
set_false_path -from [get_ports test_mode]

set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports ibias]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports pllrst]
#set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports refclk]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports spi_fs]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports spi_data]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports test_mode]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports scan_clk]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports scan_en]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[0]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[1]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[2]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[3]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[4]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[5]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[6]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[7]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[8]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[9]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[10]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[11]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[12]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[13]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[14]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_in[15]}]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports int]
set_input_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports reset]

set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports vcom]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports vcop]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[0]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[1]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[2]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[3]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[4]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[5]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[6]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[7]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[8]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[9]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[10]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[11]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[12]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[13]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[14]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {port_pad_data_out[15]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports tdigit_flag]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[0]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[1]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[2]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[3]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[4]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[5]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[6]}]
set_output_delay -clock [get_clocks refclk] -add_delay 0.3 [get_ports {tdigit[7]}]

set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports ibias]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports pllrst]
#set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports refclk]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports spi_fs]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports spi_data]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports test_mode]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports scan_clk]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports scan_en]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[0]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[1]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[2]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[3]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[4]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[5]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[6]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[7]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[8]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[9]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[10]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[11]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[12]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[13]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[14]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_in[15]}]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports int]
set_input_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports reset]

set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports vcom]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports vcop]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[0]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[1]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[2]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[3]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[4]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[5]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[6]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[7]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[8]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[9]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[10]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[11]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[12]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[13]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[14]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {port_pad_data_out[15]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports tdigit_flag]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[0]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[1]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[2]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[3]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[4]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[5]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[6]}]
set_output_delay -clock [get_clocks m_clk] -add_delay 0.3 [get_ports {tdigit[7]}]

set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports ibias]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports pllrst]
#set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports refclk]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports spi_fs]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports spi_data]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports test_mode]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports scan_clk]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports scan_en]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[0]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[1]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[2]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[3]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[4]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[5]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[6]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[7]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[8]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[9]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[10]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[11]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[12]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[13]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[14]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_in[15]}]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports int]
set_input_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports reset]

set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports vcom]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports vcop]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[0]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[1]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[2]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[3]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[4]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[5]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[6]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[7]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[8]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[9]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[10]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[11]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[12]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[13]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[14]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {port_pad_data_out[15]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports tdigit_flag]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[0]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[1]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[2]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[3]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[4]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[5]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[6]}]
set_output_delay -clock [get_clocks m_rcc_clk] -add_delay 0.3 [get_ports {tdigit[7]}]

set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports ibias]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports pllrst]
#set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports refclk]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports spi_fs]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports spi_data]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports test_mode]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports scan_clk]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports scan_en]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[0]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[1]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[2]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[3]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[4]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[5]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[6]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[7]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[8]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[9]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[10]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[11]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[12]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[13]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[14]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_in[15]}]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports int]
set_input_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports reset]

set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports vcom]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports vcop]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[0]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[1]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[2]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[3]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[4]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[5]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[6]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[7]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[8]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[9]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[10]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[11]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[12]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[13]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[14]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {port_pad_data_out[15]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports tdigit_flag]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[0]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[1]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[2]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[3]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[4]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[5]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[6]}]
set_output_delay -clock [get_clocks m_spi_clk] -add_delay 0.3 [get_ports {tdigit[7]}]

set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports ibias]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports pllrst]
#set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports refclk]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports spi_fs]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports spi_data]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports test_mode]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports scan_clk]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports scan_en]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[0]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[1]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[2]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[3]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[4]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[5]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[6]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[7]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[8]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[9]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[10]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[11]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[12]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[13]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[14]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[15]}]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports int]
set_input_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports reset]

set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports vcom]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports vcop]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[0]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[1]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[2]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[3]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[4]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[5]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[6]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[7]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[8]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[9]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[10]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[11]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[12]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[13]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[14]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[15]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports tdigit_flag]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[0]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[1]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[2]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[3]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[4]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[5]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[6]}]
set_output_delay -clock [get_clocks m_dsram_clk] -add_delay 0.3 [get_ports {tdigit[7]}]

set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports ibias]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports pllrst]
#set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports refclk]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports spi_fs]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports spi_data]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports test_mode]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports scan_clk]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports scan_en]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[0]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[1]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[2]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[3]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[4]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[5]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[6]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[7]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[8]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[9]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[10]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[11]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[12]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[13]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[14]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_in[15]}]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports int]
set_input_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports reset]

set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports vcom]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports vcop]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[0]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[1]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[2]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[3]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[4]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[5]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[6]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[7]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[8]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[9]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[10]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[11]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[12]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[13]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[14]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {port_pad_data_out[15]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports tdigit_flag]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[0]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[1]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[2]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[3]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[4]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[5]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[6]}]
set_output_delay -clock [get_clocks m_ram_clk] -add_delay 0.3 [get_ports {tdigit[7]}]

set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports ibias]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports pllrst]
#set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports refclk]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports spi_fs]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports spi_data]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports test_mode]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports scan_clk]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports scan_en]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[0]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[1]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[2]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[3]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[4]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[5]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[6]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[7]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[8]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[9]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[10]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[11]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[12]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[13]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[14]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_in[15]}]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports int]
set_input_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports reset]

set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports vcom]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports vcop]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[0]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[1]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[2]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[3]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[4]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[5]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[6]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[7]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[8]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[9]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[10]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[11]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[12]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[13]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[14]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {port_pad_data_out[15]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports tdigit_flag]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[0]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[1]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[2]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[3]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[4]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[5]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[6]}]
set_output_delay -clock [get_clocks m_digit_clk] -add_delay 0.3 [get_ports {tdigit[7]}]

set_max_fanout 15.000 [current_design]
set_max_transition 1.2 [current_design]

set_max_leakage_power 150.0 [current_design]
set_max_dynamic_power 50000.0 [current_design]

# set_wire_load_mode  "top"
# set_wire_load_model "TSMC_13k_Conservative" -library "ss_1v08_125c.lib"

# set_wire_load_model -name "TSMC32K_Lowk_Conservative" -library "tcbn65lp_c050428wc"

#set_dont_use [get_lib_cells AO/tcbn65lplvt_lvl_wc070090v125c/LVLLHCD1LVT]
#set_dont_use [get_lib_cells AO/tcbn65lplvt_lvl_wc070090v125c/LVLLHCD2LVT]
#set_dont_use [get_lib_cells AO/tcbn65lplvt_lvl_wc070090v125c/LVLLHCD4LVT]
#set_dont_use [get_lib_cells AO/tcbn65lplvt_lvl_wc070090v125c/LVLLHCD8LVT]
#set_dont_use [get_lib_cells AO/pllclk/pllclk]
#set_dont_use [get_lib_cells AO/ram_256x16_slow/ram_256x16A]
#set_dont_use [get_lib_cells AO/rom_512x16A_slow/rom_512x16A]
